[
  {
    "title": "Chicken Dumpling Soup",
    "description": "Homemade chicken and dumplings made easy!",
    "ingredients": [
      "3 tbs extra-virgin olive oil",
      "1 yellow onion, chopped",
      "4 medium carrots, peeled and sliced",
      "4 stalks celery, sliced",
      "head of garlic, minced",
      "1 tbs dried thyme",
      "2 tsp salt",
      "2 tsp black pepper",
      "32 oz low sodium chicken broth",
      "10.5 oz can cream of chicken soup",
      "2 cups water",
      "2-3 cups of shredded chicken (rotisserie chicken works well)",
      "16.3 oz can refrigerated biscuits, each biscuit cut into pieces",
      "Fresh flat-leaf parsley, for topping (optional)"
    ],
    "instructions": [
      "1. Add olive oil, onion, carrots, celery, garlic, thyme, salt, and pepper to Dutch oven or heavy saucepan. Heat on medium for 7 minutes, stirring occasionally.",
      "2. Add chicken broth, chicken soup, water and shredded chicken. Increase heat to medium-high and bring to a boil. Reduce to a simmer and add biscuit pieces. Cover and simmer for 45 minutes, stirring occasionally. Top with parsley if desired, and serve warm."
    ]
  },
  {
    "title": "Chicken Taco Bowl for 2",
    "description": "The perfect meal for 2!",
    "ingredients": [
      "1 tbs plus 1 tsp coconut oil",
      "1 jalapeño, minced, remove seeds",
      "1 green bell pepper, finely chopped, remove seeds",
      "1/4 cup chopped purple onion",
      "1 avocado, cut in chunks",
      "Half rotisserie chicken shredded (or about 2 cups, thigh meat is best, no skin)",
      "1 tsp H-E-B chicken fajita seasoning",
      "Sriracha to taste",
      "Shredded Mexican cheese"
    ],
    "instructions": [
      "1. Add 1 tbs coconut oil, peppers, and onion to pan",
      "2. Heat pan on slightly higher than medium heat until onions are translucent and peppers are getting soft and losing some color, about 5 min",
      "3. Mix fajita seasoning in with chicken then add chicken to veggies along w/other tsp of oil, mix well",
      "4. Cook for another 3-4 min",
      "5. Toss in a bowl, add cheese, avocado and top w/Sriracha",
      "*Can also make this a breakfast scramble by adding beaten eggs a couple minutes after chicken and stirring to scramble them, but only cook them for about 1 minute"
    ]
  },
  {
    "title": "Chicken Pesto Pasta",
    "description": "The best pesto pasta ever!",
    "ingredients": [
      "Jar of pesto (small Buitoni container is best",
      "Rotisserie chicken, at least 2 cups",
      "Sautéed spinach with garlic",
      "Salt/pepper",
      "Bag of rainbow rotini",
      "Parmesan cheese, grated (optional)"
    ],
    "instructions": [
      "1. Cook pasta and drain, then set back in pot or in ceramic container and add salt/pepper to taste",
      "2. Heat up chicken in pan w/olive oil (or can heat in over: 475 for 10 min, on a plate covered in foil, while pasta is cooking)",
      "3. Make spinach while pasta is cooking (takes 5 min)",
      "4. Add chicken and spinach to pasta and stir in pesto",
      "5. Add cheese if desired and more salt/pepper as needed"
    ]
  }
]
